{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Java Spring\u76f8\u5173",
    "1": "\u4ee3\u7801\u8865\u5168",
    "2": "\u52a8\u6001\u89c4\u5212",
    "3": "\u6392\u5e8f\u7b97\u6cd5",
    "4": "\u641c\u7d22\u7b97\u6cd5"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Java Spring\u76f8\u5173": 0,
    "\u4ee3\u7801\u8865\u5168": 1,
    "\u52a8\u6001\u89c4\u5212": 2,
    "\u6392\u5e8f\u7b97\u6cd5": 3,
    "\u641c\u7d22\u7b97\u6cd5": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.5.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 30522
}
